# Vi/Vim

所有的类Unix系统都会内建vi文本编辑器，目前常用的是vim，它具有程序编辑能力，可以主动的以字体颜色辨别语法的正确性，方便程序设计。

## 什么是Vim

Vim是从vi发展出来的一个文本编辑器。具有代码补全、编译即错误跳转等功能，被广泛使用。

[vim键盘图]()

## vi/vim的使用

基本上vi/vim共分为三种模式，分别是**命令模式（Command mode）**，**输入模式（Insert mode）**和**底线模式（Last line mode）**。

### 命令模式

当用户一启动vi/vim，就进入命令模式。此时敲击键盘动作会被Vim识别为命令，而非输入字符。

命令 | 用途
:-|:-
i | 切换到输入模式，以输入字符
x | 删除当前光标所在除的字符
: | 冒号。切换到底线模式，以在最底一行输入命令

### 输入模式

在命令模式下按 `i` 就切换到了输入模式。在输入模式中可以使用以下按键：

按键 | 作用
:-|:-
字符按键以及shift组合 | 输入字符
Enter | 回车换行
Backspace | 退格键，删除光标前一个字符
Delete | 删除键，删除光标后一个字符
方向键 | 在文本中移动光标
Home/End | 移动光标到行首/行尾
Page Up/Page Down | 上下翻页
Insert | 切换光标为输入/替换模式，光变将变成竖线/下划线
Esc | 退出输入模式，切换到命令模式

### 底线模式

在命令模式下按下 `:`（英文冒号）就进入到底线模式。在底线模式中，基本的命令有：

- q  退出程序
- w  保存文件

按`Esc`键可随时退出底线命令模式。

## vi/vim工作模式

1.使用vi/vim进入一般模式

直接输入`vi 文件名`就可以进入vi的一般模式。（注意，vi后面必须要跟文件名，不管文件是否存在，存在进入编辑，不存在即临时创建，待保存后创建）。

2.按下 `i` 进入输入模式(也称为编辑模式)，开始编辑文字

在一般模式之中，只要按下 `i, o, a` 等字符就可以进入输入模式。在左下角状态栏中会出现 –INSERT- 的字样，那就是可以输入任意字符的提示。

3.按下 `Esc` 键切回到一般模式

按下 Esc 这个按钮即可。

4.在一般模式中按下 `:wq` 储存后离开 `vi`

当编辑完要存档了，存盘并离开的指令很简单，输入 :wq 即可保存离开。

## vi/vim 按键说明

### 移动光标的方法

按键 | 说明 | 备注
:-|:-|:-
h 或 向左箭头键(←) | 光标向左移动一个字符 | -
j 或 向下箭头键(↓) | 光标向下移动一个字符 | 向下移动30行，可以使用组合按钮 `30j` 或 `30↓`
k 或 向上箭头键(↑) | 光标向上移动一个字符 | -
l 或 向右箭头键(→) | 光标向右移动一个字符 | -
Ctrl + f | 屏幕『向下』移动一页，相当于 [Page Down]按键 | -
Ctrl + b | 屏幕『向上』移动一页，相当于 [Page Up] 按键 | -
Ctrl + d | 屏幕『向下』移动半页 | -
Ctrl + u | 屏幕『向上』移动半页 | -
+ | 光标移动到非空格符的下一行 | -
- | 光标移动到非空格符的上一行 | -
`n<space>` | n 表示数字，按下数字后按空格键，光标会向右移动这一行的n个字符 | 例如 `20<space>` 则光标会向后面移动 20 个字符距离
0 或 功能键【Home】 | 这是数字 0 ：移动到这一行的最前面字符 | -
$ 或 功能键【End】 | 移动到这一行的最后面字符处 | -
H | 光标移动到这个屏幕的最上方那一行的第一个字符 | -
M | 光标移动到这个屏幕的中央那一行的第一个字符 | -
L | 光标移动到这个屏幕的最下方那一行的第一个字符 | -
G | 移动到这个档案的最后一行 | -
nG | n 为数字。移动到这个档案的第 n 行 | 例如 `20G` 则会移动到这个档案的第 20 行(可配合 :set nu)
gg | 移动到这个档案的第一行，相当于 1G| -
`n<Enter>` | n 为数字。光标向下移动 n 行

### 搜索替换

按键 | 说明 | 备注
:-|:-|:-
/world | 向光标之下寻找一个名称为 word 的字符串。 | 例如要在档案内搜寻 hello 这个字符串，就输入 /hello 即可
?word | 向光标之上寻找一个字符串名称为 word 的字符串 | -
n | 这个 n 是英文按键。代表重复前一个搜寻的动作 | 例如，执行 /hello 去向下搜寻 hello 这个字符串，则按下 n 后，会向下继续搜寻下一个名称为 hello 的字符串。如果是执行 ?hello 的话，那么按下 n 则会向上继续搜寻名称为 hello 的字符串
N | 这个 N 是英文按键。与 n 刚好相反，为『反向』进行前一个搜寻动作 | 例如 /hello 后，按下 N 则表示『向上』搜寻 hello
:n1,n2s/word1/word2/g | n1 与 n2 为数字。表示在第 n1 与 n2 行之间寻找 word1 这个字符串，并将该字符串取代为 word2 | 例如，在 100 到 200 行之间搜寻 hello 并取代为 Hello 则：`:100,200s/hello/Hello/g`
:1,$s/word1/word2/g 或 :%s/word1/word2/g | 从第一行到最后一行寻找 word1 字符串，并将该字符串取代为 word2 | -
:1,$s/word1/word2/gc 或 :%s/word1/word2/gc | 从第一行到最后一行寻找 word1 字符串，并将该字符串取代为 word2。且在取代前显示提示字符给用户确认 (confirm) 是否需要取代 | -

### 删除、复制与粘贴

按键 | 说明 | 备注
:-|:-|:-
x, X | 	在一行字当中，x 为向后删除一个字符 (相当于 [del] 按键)， X 为向前删除一个字符(相当于 [backspace] 亦即是退格键) | -
nx | 	n 为数字，连续向后删除 n 个字符 | 例如，连续删除 10 个字符，`10x`
dd | 	删除游标所在的那一整行 | -
ndd | n 为数字。删除光标所在的向下 n 行 | 例如，`20dd` 则是删除 20 行
d1G | 删除光标所在到第一行的所有数据 | -
dG | 删除光标所在到最后一行的所有数据 | -
d$ | 删除游标所在处，到该行的最后一个字符 | -
d0 | 那个是数字的 0 ，删除游标所在处，到该行的最前面一个字符 | -
yy | 复制游标所在的那一行 | -
nyy | n 为数字。复制光标所在的向下 n 行 | 例如 `20yy` 则是复制 20 行
y1G | 复制游标所在行到第一行的所有数据 | -
yG | 复制游标所在行到最后一行的所有数据 | -
y0 | 复制光标所在的那个字符到该行行首的所有数据 | -
y$ | 复制光标所在的那个字符到该行行尾的所有数据 | -
p, P | p 为将已复制的数据在光标下一行贴上，P 则为贴在游标上一行 | 例如，目前光标在第 20 行，且已经复制了 10 行数据。则按下 p 后， 那 10 行数据会贴在原本的 20 行之后，亦即由 21 行开始贴
J | 将光标所在行与下一行的数据结合成同一行 | -
c | 重复删除多个数据 | 例如向下删除 10 行，`10cj`
u | 复原前一个动作
Ctrl + r | 重做上一个动作

### 进入输入或取代的编辑模式

按键 | 说明 | 备注
:-|:-|:-
i, I | 进入输入模式，i 为从目前光标所在处输入， I 为在目前所在行的第一个非空格符处开始输入 | -
a, A | 进入输入模式，a 为从目前光标所在的下一个字符处开始输入， A 为从光标所在行的最后一个字符处开始输入 | -
o, O | 这是英文字母 o 的大小写。o 为在目前光标所在的下一行处输入新的一行； O 为在目前光标所在处的上一行输入新的一行 | -
r, R | r 只会取代光标所在的那一个字符一次；R会一直取代光标所在的文字，直到按下 ESC 为止 | -
Esc | 退出编辑模式，回到一般模式中 | -

### 指令行的储存、离开等指令

按键 | 说明 | 备注
:-|:-|:-
:w | 将编辑的数据写入硬盘档案中 | -
:w! | 若文件为只读时，强制写入该文档。不过最终能否真的写入还是要看文档的权限 | -
:q | 离开vi | -
:q! | 若曾修改过文档，又不想储存，使用!为强制离开不存储文档 | -
:wq | 储存后离开，若为 `:wq!` 则为强制储存后离开 | -
ZZ | 这是大写的 Z ！如果修改过，保存当前文件，然后退出。效果等同于(保存并退出) | -
ZQ | 不保存，强制退出。效果等同于 `:q!` | -
:w [filename] | 将编辑的数据储存成另一个文档 | -
:r [filename] | 在编辑的数据中，读入另一个文档的数据。亦即将 filename 这个文档内容加到游标所在行后面 | -
:n1,n2 w [filename] | 将 n1 到 n2 的内容储存成 filename 这个文档 | -
:! command | 暂时离开 vi 到指令行模式下执行 command 的显示结果 | 例如，`:! ls /home` 即可在 vi 当中察看 /home 底下以 ls 输出的文档信息 | -

### vim 环境的变更

按键 | 说明 | 备注
:-|:-|:-
:set nu | 显示行号，设定之后，会在每一行的前缀显示该行的行号 | -
:set nonu | 与 `set nu` 相反，为取消行号 | -
